<?php
$first_name = array("Александр","Алексей","Анатолий","Андрей","Антон","Аркадий","Арсений","Артём","Артур","Борис","Вадим","Валентин","Валерий","Василий","Виктор","Виталий","Владимир","Владислав","Вячеслав","Георгий","Глеб","Григорий","Даниил","Денис","Дмитрий","Евгений","Егор","Иван","Игорь","Илья","Кирилл","Константин","Лев","Леонид","Максим","Марк","Матвей","Михаил","Никита","Николай","Олег","Павел","Пётр","Роман","Руслан","Сергей","Степан","Тимур","Фёдор","Юрий","Ярослав");
$last_name = array("Дом","Стол","Стул","Компьютер","Машина","Автобус","Поезд","Школа","Ручка","Карандаш","Тетрадь","Дерево","Камень","Вода","Воздух","Книга","Цветок","Мочалка","Пиво","Лютый","Фура","Тройник","Кружка","Вилка","Чипсы","Чайник","Плита","Зарядка","Коробка","Мышь","Самосвал","Маска","Тряпка","Носок");
$name = $first_name[array_rand($first_name)].$last_name[array_rand($last_name)]; // Имя анона

$threads_on_board = 25; // сколько тредов на странице
$posts_on_thread = 200; // постов на странице в треде
$max_threads = 50; // максимум тредов на доске
$max_posts = 500; // максимум постов в треде

$title_len = 50; // длина текста заголовка
$text_len = 5000; // длина текста

$threads_dir = "./threads/"; // dir threads
?>